app/Controllers/Desa.php

SELECT *
FROM `desa`
JOIN `kecamatan` ON `kecamatan`.`kode_kecamatan` = `desa`.`kode_kecamatan`
---
    public function tampil() {
        $desa = new DesaModel();
        // Mengambil semua data di tabel desa dan kecamatan menggunakan JOIN
        $data['query'] = $desa->join('kecamatan', 'kecamatan.kode_kecamatan = desa.kode_kecamatan')->findAll();

SELECT *
FROM `kecamatan`
---
    public function tambah() {
        $kecamatan = new KecamatanModel();
        $kecamatan = $kecamatan->findAll();

INSERT INTO `desa` (`kode_desa`, `kode_kecamatan`, `nama_desa`, `alamat_desa`, `koordinat`) VALUES ('33212006', '3302010', 'Cidora', 'Cidora, Kec. Lumbir, Kabupaten Banyumas', '-7.4762057,108.982588')
---
    public function simpan() {
        $desa = new DesaModel();
        // Mengambil data dari masing-masing input pada form tambah
        // dan disimpan pada array untuk disimpan ke tabel desa
        $data_desa = [
            'kode_desa' => $this->request->getVar('kode_desa'),
            'kode_kecamatan' => $this->request->getVar('kode_kecamatan'),
            'nama_desa' => $this->request->getVar('nama_desa'),
            'alamat_desa' => $this->request->getVar('alamat_desa'),
            'koordinat' => $this->request->getVar('koordinat')
        ];
        // Menggunakan query builder insert untuk menyimpan ke tabel desa
        $desa->insert($data_desa);

DELETE FROM `desa`
WHERE `kode_desa` IN ('33212006')
---
    public function hapus($kode_desa) {
        $desa = new DesaModel();
        // Menggunakan query builder delete untuk menghapus data di tabel desa sesuai kode_desa
        $desa->delete(['kode_desa' => $kode_desa]);